Revit 2027 API
Blend.TopOffset Property
The offset of the top end of the blend relative to the sketch plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TopOffset { get; set; }
Public Property TopOffset As Double
	Get
	Set
public:
property double TopOffset {
	double get ();
	void set (double value);
}
member TopOffset : float with get, set
Property Value
Double
See Also
Reference
Blend Class
Autodesk.Revit.DB Namespace